{
  "backend/main.mo": "Actor implementing user profile management with access control plus enquiry storage and retrieval with ID-based records.",
  "feature_evidence.json": "Feature evidence report listing two features, affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-style list summarizing all frontend files and their responsibilities.",
  "frontend/index.css": "Tailwind base styles defining extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "App router configuration defining root layout and routes for home, courses, about, and contact pages.",
  "frontend/src/components/site/PageLayout.tsx": "Simple wrapper component providing a minimum-height layout.",
  "frontend/src/components/site/SiteFooter.tsx": "Footer showing branding, navigation links, course categories, and institute contact details.",
  "frontend/src/components/site/SiteHeader.tsx": "Header with logo, navigation links, and mobile sheet menu plus an enquiry button.",
  "frontend/src/content/coursesCatalog.ts": "Structured course catalog defining categories with descriptions, colors, and course lists.",
  "frontend/src/content/instituteDetails.ts": "Exports static institute contact and location details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and triggers query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication and identity management.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for backend-related React Query hooks.",
  "frontend/src/hooks/useSubmitEnquiry.ts": "Defines a mutation hook to submit enquiries to the backend and refresh related queries.",
  "frontend/src/index.css": "Configures Tailwind styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and institute offerings.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and enquiry submission plus displays institute contact info.",
  "frontend/src/pages/CoursesPage.tsx": "Displays course categories and course cards sourced from the courses catalog.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero banner, feature highlights, and links to courses and contact sections using Tailwind and custom UI components.",
  "frontend/src/utils/courseCategoryMapping.ts": "Maps string category names to typed CourseCategory variants or null if unsupported.",
  "frontend/src/utils/enquiryValidation.ts": "Validates enquiry form fields, returning error messages for invalid name, phone, email, or message inputs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, plugins, and content paths for the frontend.",
  "project_state.json": "Stores project metadata, requirements, and notes describing the SMART DESK website’s state and features."
}